HELYXcore-4.4.0/examples/legacy/lagrangian/reactingParcelFoam/counterFlowFlame2DLTS/0/T
/*--------------------------------*- C++ -*----------------------------------*\
|       o        |                                                            |
|    o     o     |  HELYX (R) : Open-source CFD for Enterprise                |
|   o   O   o    |  Version : 4.4.0                                           |
|    o     o     |  ENGYS Ltd. <http://engys.com/>                            |
|       o        |                                                            |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 293;

boundaryField
{
    fuel
    {
        type            fixedValue;
        value           uniform 800;
    }
    air
    {
        type            fixedValue;
        value           uniform 800;
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform 293;
        value           uniform 293;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
